#### Terraform Format Check 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.aws_region.current: Reading...
data.aws_organizations_organization.current: Reading...
data.aws_caller_identity.current: Reading...
aws_cloudformation_stack.terraform_remote_state: Refreshing state... [id=terraform-remote-state]
data.aws_region.current: Read complete after 0s [id=eu-west-2]
data.aws_caller_identity.current: Read complete after 0s [id=445567079474]
aws_s3_object.terraform_remote_state: Refreshing state... [id=terraform-remote-state.yaml]
aws_s3_bucket.organisation_stacksets: Refreshing state... [id=organisation-stacksets-445567079474]
data.aws_organizations_organization.current: Read complete after 1s [id=o-hexz300bjw]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_cloudformation_stack.terraform_remote_state will be destroyed
  # (because aws_cloudformation_stack.terraform_remote_state is not in configuration)
  - resource "aws_cloudformation_stack" "terraform_remote_state" {
      - capabilities       = [
          - "CAPABILITY_NAMED_IAM",
        ] -> null
      - disable_rollback   = false -> null
      - id                 = "terraform-remote-state" -> null
      - name               = "terraform-remote-state" -> null
      - outputs            = {} -> null
      - parameters         = {
          - "GithubOrganisation" = "nvthvniel"
          - "GithubRepository"   = "aws-terraform"
        } -> null
      - tags               = {} -> null
      - tags_all           = {} -> null
      - template_body      = <<-EOT
            Parameters:
              "GithubOrganisation":
                Description: "Name of GitHub organisation"
                Type: "String"
              
              "GithubRepository":
                Description: "Name of GitHub repository"
                Type: "String"
            
            Resources:
            
              OIDCProvider:
                Type: AWS::IAM::OIDCProvider
                Properties:
                  ClientIdList:
                    - "sts.amazonaws.com"
                  Url: "https://token.actions.githubusercontent.com"
            
              IAMRole:
                Type: AWS::IAM::Role
                DependsOn: OIDCProvider
                Properties:
                  RoleName: "github-terraform"
                  Description: "Manage Terraform remote state via GitHub actions"
                  MaxSessionDuration: 3600 # 1 hour
                  AssumeRolePolicyDocument:
                    Version: "2012-10-17"
                    Statement:
                      - Effect: Allow
                        Principal:
                          Federated: !Sub "arn:aws:iam::${AWS::AccountId}:oidc-provider/token.actions.githubusercontent.com"
                        Action:
                          - 'sts:AssumeRoleWithWebIdentity'
                        Condition:
                          StringEquals:
                            "token.actions.githubusercontent.com:aud": "sts.amazonaws.com"
                          StringLike:
                            "token.actions.githubusercontent.com:sub": !Sub "repo:${GithubOrganisation}/${GithubRepository}:*"
                  ManagedPolicyArns:
                    - "arn:aws:iam::aws:policy/AdministratorAccess"
            
              S3Bucket:
                Type: AWS::S3::Bucket
                DeletionPolicy: "RetainExceptOnCreate"
                Properties:
                  BucketName: !Sub "terraform-remote-state-${AWS::AccountId}"
            
                  OwnershipControls:
                    Rules:
                      - ObjectOwnership: "BucketOwnerEnforced"
                  
                  PublicAccessBlockConfiguration:
                    BlockPublicAcls: True
                    BlockPublicPolicy: True
                    IgnorePublicAcls: True
                    RestrictPublicBuckets: True
              
              S3BucketPolicy:
                Type: AWS::S3::BucketPolicy
                DependsOn: IAMRole
                Properties:
                  Bucket: !Sub "terraform-remote-state-${AWS::AccountId}"
                  PolicyDocument:
                    Version: "2012-10-17"
                    Statement:
                      - Sid: "TerraformBucket"
                        Effect: "Allow"
                        Action:
                          - "s3:ListBucket"
                        Principal:
                          "AWS": !Sub "arn:aws:iam::${AWS::AccountId}:root"
                        Resource:
                          - !Sub "arn:aws:s3:::terraform-remote-state-${AWS::AccountId}"
            
                      - Sid: "TerraformApplyObject"
                        Effect: "Allow"
                        Action:
                          - "s3:PutObject"
                        Principal:
                          "AWS": !Sub "arn:aws:iam::${AWS::AccountId}:role/github-terraform"
                        Resource:
                          - !Sub "arn:aws:s3:::terraform-remote-state-${AWS::AccountId}/*"
            
                      - Sid: "TerraformPlanObject"
                        Effect: "Allow"
                        Action:
                          - "s3:GetObject"
                        Principal:
                          "AWS": !Sub "arn:aws:iam::${AWS::AccountId}:root"
                        Resource:
                          - !Sub "arn:aws:s3:::terraform-remote-state-${AWS::AccountId}/*"
              
              DynamoDBTable:
                Type: AWS::DynamoDB::Table
                DependsOn: IAMRole
                Properties:
                  TableName: !Sub "terraform-remote-state-${AWS::AccountId}"
                  TableClass: "STANDARD"
                  BillingMode: "PAY_PER_REQUEST"
                  AttributeDefinitions:
                    - AttributeName: "LockID"
                      AttributeType: "S"
                  KeySchema:
                    - AttributeName: "LockID"
                      KeyType: "HASH"
                  ResourcePolicy:
                    PolicyDocument:
                      Version: "2012-10-17"
                      Statement:
                        - Sid: "Terraform"
                          Effect: "Allow"
                          Action:
                            - "dynamodb:DescribeTable"
                            - "dynamodb:GetItem"
                            - "dynamodb:PutItem"
                            - "dynamodb:DeleteItem"
                          Principal:
                            "AWS": !Sub "arn:aws:iam::${AWS::AccountId}:root"
                          Resource:
                            - !Sub "arn:aws:dynamodb:${AWS::Region}:${AWS::AccountId}:table/terraform-remote-state-${AWS::AccountId}"
        EOT -> null
      - template_url       = "https://organisation-stacksets-445567079474.s3.eu-west-2.amazonaws.com/terraform-remote-state.yaml" -> null
      - timeout_in_minutes = 3 -> null
        # (1 unchanged attribute hidden)
    }

  # aws_cloudformation_stack_set.terraform_remote_state will be created
  + resource "aws_cloudformation_stack_set" "terraform_remote_state" {
      + arn                 = (known after apply)
      + call_as             = "SELF"
      + capabilities        = [
          + "CAPABILITY_IAM",
          + "CAPABILITY_NAMED_IAM",
        ]
      + execution_role_name = (known after apply)
      + id                  = (known after apply)
      + name                = "terraform-remote-state"
      + parameters          = {
          + "GithubOrganisation" = "nvthvniel"
          + "GithubRepository"   = "aws-terraform"
        }
      + permission_model    = "SERVICE_MANAGED"
      + stack_set_id        = (known after apply)
      + tags_all            = {
          + "terraform" = "true"
        }
      + template_body       = (known after apply)
      + template_url        = "https://organisation-stacksets-445567079474.s3.eu-west-2.amazonaws.com/terraform-remote-state.yaml"

      + auto_deployment {
          + enabled                          = true
          + retain_stacks_on_account_removal = false
        }

      + operation_preferences {
          + failure_tolerance_count   = 1
          + max_concurrent_percentage = 100
        }
    }

  # aws_cloudformation_stack_set_instance.terraform_remote_state will be created
  + resource "aws_cloudformation_stack_set_instance" "terraform_remote_state" {
      + account_id               = (known after apply)
      + call_as                  = "SELF"
      + id                       = (known after apply)
      + organizational_unit_id   = (known after apply)
      + region                   = "eu-west-2"
      + retain_stack             = false
      + stack_id                 = (known after apply)
      + stack_instance_summaries = (known after apply)
      + stack_set_name           = "terraform-remote-state"

      + deployment_targets {
          + organizational_unit_ids = [
              + "r-t0l4",
            ]
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```